tap "andyjakubowski/software"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "stripe/stripe-cli"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Cross-platform make
brew "cmake"
# C library implementing the SSH2 protocol
brew "libssh2"
# Modern, maintained replacement for ls
brew "eza"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# UNIX shell (command interpreter)
brew "zsh"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Markdown editor for developers
cask "boostnote"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Free and open-source RSS reader
cask "netnewswire"
cask "notational-velocity"
# Replacement for Docker Desktop
cask "orbstack"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Web browser
cask "safari-technology-preview"
# Block your own access to distracting websites
cask "selfcontrol"
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch74"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Color Picker", id: 1545870783
mas "Divvy", id: 413857545
mas "Flowstate", id: 1051600144
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Kindle", id: 302584613
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pomodoro", id: 417574133
mas "Presentify", id: 1507246666
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "ahmadawais.shades-of-purple"
vscode "alexcvzz.vscode-sqlite"
vscode "arcanis.vscode-zipfs"
vscode "attilabuti.vscode-mjml"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bubersson.theme-hop-light"
vscode "burkeholland.simple-react-snippets"
vscode "burkeholland.vs-code-can-do-that"
vscode "christian-kohler.npm-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "cssho.vscode-svgviewer"
vscode "dae.vscode-mac-color-picker"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mattpocock.ts-error-translator"
vscode "mf.vscode-styled-components"
vscode "mgmcdermott.vscode-language-babel"
vscode "miguelsolorio.min-theme"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mythmon.idl"
vscode "nathanridley.autotrim"
vscode "naumovs.color-highlight"
vscode "naumovs.theme-oceanicnext"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "rbuckton.tsserver-live-reload"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "shopify.ruby-lsp"
vscode "statelyai.stately-vscode"
vscode "stylelint.vscode-stylelint"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
